results/IntelR_XeonR_Gold_6130_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_fillrandom.log
/usr/bin/time -f '%e %U %S' -o /tmp/app-repl-numa-benchmarks/results/IntelR_XeonR_Gold_6130_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_fillrandom.log.time ./db_bench --benchmarks=fillrandom,stats --use_existing_db=0 --disable_auto_compactions=1 --sync=0 --max_background_jobs=16 --max_write_buffer_number=8 --allow_concurrent_memtable_write=false --level0_file_num_compaction_trigger=10485760 --level0_slowdown_writes_trigger=10485760 --level0_stop_writes_trigger=10485760 --undefok=use_blob_cache,use_shared_block_and_blob_cache,blob_cache_size,blob_cache_numshardbits,prepopulate_blob_cache,multiread_batched,cache_low_pri_pool_ratio,prepopulate_block_cache --db=/tmp/rocksdb/db --wal_dir=/tmp/rocksdb/wal --num=8000000 --key_size=20 --value_size=400 --block_size=8192 --cache_size=32000000000 --cache_numshardbits=6 --compression_max_dict_bytes=0 --compression_ratio=0.5 --compression_type=none --bytes_per_sync=1048576 --benchmark_write_rate_limit=0 --write_buffer_size=134217728 --target_file_size_base=134217728 --max_bytes_for_level_base=1073741824 --verify_checksum=1 --delete_obsolete_files_period_micros=62914560 --max_bytes_for_level_multiplier=8 --statistics=0 --stats_per_interval=1 --stats_interval_seconds=60 --report_interval_seconds=1 --histogram=1 --memtablerep=skip_list --bloom_bits=10 --open_files=-1 --subcompactions=1 --compaction_style=0 --num_levels=8 --min_level_to_compress=-1 --level_compaction_dynamic_level_bytes=true --pin_l0_filter_and_index_blocks_in_cache=1 --threads=1 --memtablerep=vector --allow_concurrent_memtable_write=false --disable_wal=1 --seed=1764725049 --report_file=/tmp/app-repl-numa-benchmarks/results/IntelR_XeonR_Gold_6130_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_fillrandom.log.r.csv 2>&1 | tee -a /tmp/app-repl-numa-benchmarks/results/IntelR_XeonR_Gold_6130_CPU_@_2.10GHz_X86_64/rocksdb/outputs/bulkload/benchmark_bulkload_fillrandom.log
RocksDB:    version 10.5.0
Date:       Wed Dec  3 02:24:09 2025
CPU:        128 * Intel(R) Xeon(R) Gold 6130 CPU @ 2.10GHz
CPUCache:   22528 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       20 bytes each (+ 0 bytes user-defined timestamp)
Values:     400 bytes each (200 bytes after compression)
Entries:    8000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    3204.3 MB (estimated)
FileSize:   1678.5 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: VectorRepFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/tmp/rocksdb/db]
fillrandom   :       1.060 micros/op 943515 ops/sec 8.479 seconds 8000000 operations;  377.9 MB/s
Microseconds per write:
Count: 8000000 Average: 1.0598  StdDev: 16.65
Min: 0  Median: 0.5231  Max: 8860
Percentiles: P50: 0.52 P75: 0.78 P99: 2.77 P99.9: 7.55 P99.99: 1113.29
------------------------------------------------------
[       0,       1 ]  7646767  95.585%  95.585% ###################
(       1,       2 ]    94934   1.187%  96.771% 
(       2,       3 ]   232912   2.911%  99.683% #
(       3,       4 ]     5073   0.063%  99.746% 
(       4,       6 ]    10697   0.134%  99.880% 
(       6,      10 ]     4174   0.052%  99.932% 
(      10,      15 ]     1725   0.022%  99.954% 
(      15,      22 ]     1480   0.019%  99.972% 
(      22,      34 ]       89   0.001%  99.973% 
(      34,      51 ]       28   0.000%  99.973% 
(      51,      76 ]       95   0.001%  99.975% 
(      76,     110 ]       84   0.001%  99.976% 
(     110,     170 ]       58   0.001%  99.976% 
(     170,     250 ]       20   0.000%  99.977% 
(     250,     380 ]       17   0.000%  99.977% 
(     380,     580 ]       16   0.000%  99.977% 
(     580,     870 ]       12   0.000%  99.977% 
(     870,    1300 ]     1801   0.023% 100.000% 
(    1300,    1900 ]       11   0.000% 100.000% 
(    1900,    2900 ]        4   0.000% 100.000% 
(    2900,    4400 ]        1   0.000% 100.000% 
(    4400,    6600 ]        1   0.000% 100.000% 
(    6600,    9900 ]        1   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) WPreComp(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     19/0      2.62 GB  10.1      0.0     0.0      0.0       2.6       2.6      2.6       0.0   1.0      0.0    108.7     24.73             13.45        19    1.302   6728K      0       0.0       0.0
 Sum     19/0      2.62 GB   0.0      0.0     0.0      0.0       2.6       2.6      2.6       0.0   1.0      0.0    108.7     24.73             13.45        19    1.302   6728K      0       0.0       0.0
 Int      0/0      0.00 KB   0.0      0.0     0.0      0.0       1.5       1.5      1.5       0.0   1.0      0.0    108.3     14.61              7.87        10    1.461   3975K      0       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) WPreComp(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0      0.00 KB   0.0      0.0     0.0      0.0       2.6       2.6      2.6       0.0   0.0      0.0    108.7     24.73             13.45        19    1.302   6728K      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 8.5 total, 4.5 interval
Flush(GB): cumulative 2.624, interval 1.545
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 2.62 GB write, 316.71 MB/s write, 0.00 GB read, 0.00 MB/s read, 24.7 seconds
Interval compaction: 1.55 GB write, 353.23 MB/s write, 0.00 GB read, 0.00 MB/s read, 14.6 seconds
Estimated pending compaction bytes: 2817589265
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 4, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 4, total-stops: 0
interval: 3 total count
Block cache LRUCache@0x562d855ebeb0#1219987 capacity: 29.80 GB seed: 1764725049 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000152 secs_since: 8
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 8.5 total, 4.5 interval
Cumulative writes: 0 writes, 8000K keys, 0 commit groups, 0.0 writes per commit group, ingest: 3.25 GB, 392.07 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:1.918 H:M:S, 22.6 percent
Interval writes: 0 writes, 3416K keys, 0 commit groups, 0.0 writes per commit group, ingest: 1420.54 MB, 317.13 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Interval stall: 00:00:1.840 H:M:S, 41.1 percent
Write Stall (count): write-buffer-manager-limit-stops: 0